{
  "Quienes somos y que hacemos": "Somos el grupo Cortes y los cortesitos, somos 5 fullstack developers estudiando el modulo de DAM y vamos a desarrollar un proyecto",
  "Nuestro objetivo": "Desarrollar una aplicacion sobre una idea innovadora",
  "Nuestros principios": "El trabajo duro, el esfuerzo, la dedicacion, la pasion, ser uno con el codigo y pasarlo bien en el proceso",
  "Nuestras normas": "Llegar a teimpo a clase, no faltar mas de lo estipulado(10%), entregar tu parte del trabajo",
  "Cosas que nunca haremos": "Llegar tarde y dejar un trabajo sin entregar",
  "Como tomamos decisiones": "Cortes decide el destino de los cortesitos",
  "Que hacemos cuando se rompen las reglas": "comprar una unidad de croquetas de la universidad a cada participante",
  "Cuando y como pedimos ayuda": "siempre que la necesitamos, pedir ayuda no es malo",
  "firmas": {
    "Iker": {
      "firmado": true,
      "fecha": "26-09-2025 08:45"
    },
    "Dani": {
      "firmado": true,
      "fecha": "26-09-2025 08:59"
    },
    "Lander": {
      "firmado": true,
      "fecha": "26-09-2025 08:59"
    },
    "Julen": {
      "firmado": true,
      "fecha": "26-09-2025 09:01"
    },
    "Ander": {
      "firmado": true,
      "fecha": "26-09-2025 09:01"
    }
  },
  "habilidades": {
    "Lander": {
      "competencias_tecnicas": {
        "ERP/Odoo": {
          "fortalezas": "Se lo que son los ERP y tengo una idea básica de que es Odoo pero no se utilizarlo ni implementarlo",
          "necesidades": "Necesito aprender prácticamente todo sobre como se utiliza bien Odoo y como implementarlo a nuestros futuros programas."
        },
        "Docker/Contenedores": {
          "fortalezas": "Se crear contenedores y instalar imágenes así como copiar archivos de un contenedor a fuera de el mismo.",
          "necesidades": "Como usarlo correctamente y que aplicaciones útiles podría tener para nuestros proyectos."
        },
        "Base de datos (Postgres)": {
          "fortalezas": "Tengo nociones básicas sobre como usar bases de datos pero nunca he usado Postgres.",
          "necesidades": "Necesito aprender las diferencias entre MySQL que es la que se usar y Postgres."
        },
        "Integraciones (Java/Otros)": {
          "fortalezas": "Se programar tanto en Java como en Python.",
          "necesidades": "Aunque se integrar Python, tengo que aprender como integrar también Java."
        },
        "Gestión del proyecto": {
          "fortalezas": "No suelo hacerlo pero se gestionar bien los proyectos.",
          "necesidades": "Sobre todo me centro mas en hacerlos que en gestionarlos por que no le doy tanta importancia así que debería aprender a gestionar mejor."
        },
        "Infraestructura/DevOps": {
          "fortalezas": "No se absolutamente nada.",
          "necesidades": "Que es, como funciona, para que sirve, etc."
        }
      },
      "competencias_transversales": {
        "Comunicación oral": {
          "fortalezas": "Se me da bien hablar.",
          "necesidades": "Mejorar la expresión corporal."
        },
        "Comunicación escrita": {
          "fortalezas": "Se escribir de formar resumida y esquematica.",
          "necesidades": "Se me da mal escribir largos textos correctamente."
        },
        "Trabajo en equipo": {
          "fortalezas": "Se me da bien trabajar en equipo si se reparte el trabajo.",
          "necesidades": "Se me da mal coordinarme cuando tengo que trabajar con otra persona en la misma parte del proyecto."
        },
        "Competencia personal": {
          "fortalezas": " ",
          "necesidades": " "
        }
      }
    },
    "Ander": {
      "competencias_tecnicas": {
        "ERP/Odoo": {
          "fortalezas": "Las competencias tecnicas de las que dispongo son conocimientos basicos de Python lo que aprendimos a usar de Odoo el curso pasado y lo mismo con React",
          "necesidades": "Ya que lo que aprendimos fue poco rapido y en poco tiempo me hace falta centrarme mas en cada apartado para aprender a profundidad las competencias tecnicas necesarias"
        },
        "Docker/Contenedores": {
          "fortalezas": "Los conocimientos son minimos se hacer lo basico lo mas simple",
          "necesidades": "Seguir reforzando mis conocimientos con lo que aprendamos mayormente en clase de Che"
        },
        "Base de datos (Postgres)": {
          "fortalezas": "En Postgres exactamente no tengo ninguna fortaleza en otras bases de datos regular una vez programe una base de datos para el fichaje de Octe Electric",
          "necesidades": "Basicamente todo Postgres"
        },
        "Integraciones (Java/Otros)": {
          "fortalezas": "Diria que me defiendo mejor que en otras cosas de todas las competencias tecnicas mi preferida y donde mas conocimiento y practica tengo",
          "necesidades": "Perfeccionar puntos sobre todo al conectarlo con bases de datos"
        },
        "Gestion del proyecto": {
          "fortalezas": "Personalmente la gestion de los proyectos lo llevo regular aunque intento trabajarlo y mas cuando es en trabajo",
          "necesidades": "Aprender a planificar tareas coordinar al equipo y organizar el flujo de trabajo"
        },
        "Infraestructura/DevOps": {
          "fortalezas": "No tengo conocimientos",
          "necesidades": "Aprender que es DevOps como funciona y como aplicarlo en proyectos reales"
        }
      },
      "competencias_transversales": {
        "Comunicacion oral": {
          "fortalezas": "Puedo expresarme bien y participar en reuniones",
          "necesidades": "Mejorar la seguridad al hablar en publico y la claridad al explicar ideas"
        },
        "Comunicacion escrita": {
          "fortalezas": "Se escribir de manera clara y resumida",
          "necesidades": "Mejorar la redaccion de textos largos y documentacion tecnica"
        },
        "Trabajo en equipo": {
          "fortalezas": "Me adapto bien al equipo y suelo colaborar",
          "necesidades": "Aprender a coordinar mejor tareas compartidas y resolver conflictos"
        },
        "Competencia personal": {
          "fortalezas": "Soy responsable y comprometido con las tareas",
          "necesidades": "Trabajar en la autoconfianza y gestion del tiempo"
        }
      }
    },
    "Julen": {
      "competencias_tecnicas": {
        "ERP/Odoo": {
          "fortalezas": "La verdad que aun no he gestionado nada con odoo pero en general aprendo rapido ",
          "necesidades": "aprender a usar odoo "
        },
        "Docker/Contenedores": {
          "fortalezas": "he usado docker previamente para trabajo y proyectos personales ",
          "necesidades": "quiza dependo demasiado de la interfaz de docker "
        },
        "Base de datos (Postgres)": {
          "fortalezas": "he usado otras bases de datos antes y me suele gustar la parte del backend ",
          "necesidades": "nunca he usado postgres asi que tendre que adaptarme "
        },
        "Integraciones (Java/Otros)": {
          "fortalezas": "considero que se programar decentemente ademas como ya he dicho aprendo rapido ",
          "necesidades": "aveces dependo demasiado de la ia para aprender nuevas cosas "
        },
        "Gestión del proyecto": {
          "fortalezas": "Suelo colaborar bien con mis compañeros y aportar ideas",
          "necesidades": "no suelo mantener el orden soy muy desorganizado con las ideas "
        },
        "Infraestructura/DevOps": {
          "fortalezas": "No se absolutamente nada.",
          "necesidades": "aprender :) "
        }
      },
      "competencias_transversales": {
        "Comunicación oral": {
          "fortalezas": "me comunico bien con mis compañeros y suelo intentar ser agradable ",
          "necesidades": "no siempre trabajo aveces me distraigo "
        },
        "Comunicación escrita": {
          "fortalezas": "me expreso bien escribiendo ",
          "necesidades": "entender del todo la importancia de la documentacion "
        },
        "Trabajo en equipo": {
          "fortalezas": "me gusta trabajar en equipo y ayudar a mis compañeros si lo necesitan ",
          "necesidades": "suelo frustrarme cuando las cosas no salen bien "
        },
        "Competencia personal": {
          "fortalezas": "en general considero que soy bastante buen compañero ",
          "necesidades": "me sulo frustrar y me distraigo facil "
        }
      }
    },
    "Iker": {
      "competencias_tecnicas": {
        "ERP/Odoo": {
          "fortalezas": "No tengo experiencia practica con Odoo pero me interesa aprender rapido",
          "necesidades": "Aprender desde cero a usar Odoo y entender su implementacion en proyectos reales"
        },
        "Docker/Contenedores": {
          "fortalezas": "Tengo conocimientos basicos de informatica y algo de manejo de entornos virtuales",
          "necesidades": "Aprender a crear administrar y optimizar contenedores Docker para distintos proyectos"
        },
        "Base de datos (Postgres)": {
          "fortalezas": "He trabajado con bases de datos sencillas en clase y en proyectos pequenos",
          "necesidades": "Aprender Postgres y su integracion con aplicaciones ademas de diferenciarlo de MySQL"
        },
        "Integraciones (Java/Otros)": {
          "fortalezas": "Se algo de programacion en Java y Python a nivel basico",
          "necesidades": "Aprender a integrar distintos lenguajes y APIs en proyectos colaborativos"
        },
        "Gestion del proyecto": {
          "fortalezas": "Tengo nociones basicas de planificacion y organizacion de tareas",
          "necesidades": "Aprender tecnicas de gestion de proyectos y coordinacion de equipos"
        },
        "Infraestructura/DevOps": {
          "fortalezas": "No tengo experiencia",
          "necesidades": "Conocer fundamentos de DevOps automatizacion y mantenimiento de infraestructuras"
        }
      },
      "competencias_transversales": {
        "Comunicacion oral": {
          "fortalezas": "Me expreso con claridad y suelo participar en reuniones",
          "necesidades": "Ganar confianza al hablar en publico y mejorar la persuasión al comunicar ideas"
        },
        "Comunicacion escrita": {
          "fortalezas": "Puedo redactar textos cortos de manera correcta",
          "necesidades": "Mejorar la redaccion de informes largos y documentacion tecnica"
        },
        "Trabajo en equipo": {
          "fortalezas": "Me adapto bien a distintos roles dentro de un equipo",
          "necesidades": "Aprender a coordinar tareas compartidas y resolver conflictos de forma efectiva"
        },
        "Competencia personal": {
          "fortalezas": "Soy responsable y cumplo con los compromisos adquiridos",
          "necesidades": "Trabajar en la autoconfianza y en la gestion del tiempo"
        }
      }
    },
    "Daniel": {
      "competencias_tecnicas": {
        "ERP/Odoo": {
          "fortalezas": "Use algo odoo hace dos años en un proyecto de clase, pero cosas muy basicas",
          "necesidades": "Necesito recordar lo poco que aprendi y aprender a usarlo bien"
        },
        "Docker/Contenedores": {
          "fortalezas": "He empezado este año en clase a usarlo pero en el trabajo creo que tambien lo voy a usar",
          "necesidades": "Necesito aprender más sobre su implementación y gestión en entornos de producción"
        },
        "Base de datos (Postgres)": {
          "fortalezas": "No he usado nunca Postgres como base de datos pero y Mysql y oracle",
          "necesidades": "Necesito aprender el funcionamiento de Postgres y sus diferencias con Mysql"
        },
        "Integraciones (Java/Otros)": {
          "fortalezas": "Llevo usando java dos años y en el trbajo he usado algo python",
          "necesidades": "Nose que lenguaje vamos ha usar pero seguramente aprender mas opciones de integracion"
        },
        "Gestión del proyecto": {
          "fortalezas": "Suelo ser tranquilo y organizado, intento saber en todo momento que hace cada uno para organizarme",
          "necesidades": "Al ser nuevos grupos creo que necesitamos mas conexion entre nosotros y organizarnos mejor"
        },
        "Infraestructura/DevOps": {
          "fortalezas": "No se ni lo que es",
          "necesidades": "Aprender desde 0 que es y para que sirve"
        }
      },
      "competencias_transversales": {
        "Comunicación oral": {
          "fortalezas": "Suelo comunicarme mis opiniones aunque en las presentaciones suelo estar algo nervioso",
          "necesidades": "Mejorar la expresion corporal y controlar los nervios"
        },
        "Comunicación escrita": {
          "fortalezas": "Suelo escribir mis ideas de forma clara y concisa",
          "necesidades": "Mejorar la estructura y organización de mis escritos, aparte de la ortografía"
        },
        "Trabajo en equipo": {
          "fortalezas": "Suelo colaborar bien con mis compañeros y aportar ideas",
          "necesidades": "Mejorar la escucha activa y la empatía hacia los demás"
        },
        "Competencia personal": {
          "fortalezas": "Suelo ser autocrítico y buscar mejorar mis habilidades",
          "necesidades": "Trabajar en mi autoconfianza y en la gestión del estrés"
        }
      }
    }
  }
}